/******************************************************************************
* 此文件为 PDB 操作的协议格式定义文件
* 
******************************************************************************/
#ifndef _PDB_PROT_H_
#define _PDB_PROT_H_

//消息类型指令定义
typedef enum _PDB_CMD
{
    // 100 以内内部保留 

    // 100 - 200 测试用 
    CMD_QUERY_VIP = 101, //查询vip
    CMD_TEST_CINTF = 102, 
    CMD_TEST_COMM = 103,
    CMD_TEST_ADMIN_STT = 104, 
    // 200-999 为 游戏人生 igame 项目使用命令字
/******************************************************************************
 * 积分系统(pnh)指令 201 - 220 
 * 荣誉系统(pnh)指令 221 - 299 
 * 
 ******************************************************************************/ 
    
    CMD_IBC_TEST = 999,
    // 1000 - 2000 为 cross 使用命令字
    
    CMD_PDB_END
}PDB_CMD;

#endif //_PDB_PROT_H_
